In [1]:
import numpy as np
import pandas as pd

In [2]:
#finding missing data

In [3]:
data={
    'A' : [1,np.nan,3,4,5],
    'B' : [1,2,3,4,5],
    'C' : [1 ,np.nan,3,np.nan,5],
    'D' : [np.nan,2,3,np.nan,np.nan]
}
df = pd.DataFrame(data)

In [4]:
df

     A  B    C    D
0  1.0  1  1.0  NaN
1  NaN  2  NaN  2.0
2  3.0  3  3.0  3.0
3  4.0  4  NaN  NaN
4  5.0  5  5.0  NaN

In [5]:
df.isna()

       A      B      C      D
0  False  False  False   True
1   True  False   True  False
2  False  False  False  False
3  False  False   True   True
4  False  False  False   True

In [6]:
df.isna().sum()

A    1
B    0
C    2
D    3
dtype: int64

In [7]:
df.isna().any()

A     True
B    False
C     True
D     True
dtype: bool

In [8]:
#removing missing data

In [9]:
df

     A  B    C    D
0  1.0  1  1.0  NaN
1  NaN  2  NaN  2.0
2  3.0  3  3.0  3.0
3  4.0  4  NaN  NaN
4  5.0  5  5.0  NaN

In [10]:
df.dropna()   #it work rows wise    only give non null rows

     A  B    C    D
2  3.0  3  3.0  3.0

In [11]:
df.dropna(thresh=3)   #gives the rows in which the element in rows has 3 or more non-null element

     A  B    C    D
0  1.0  1  1.0  NaN
2  3.0  3  3.0  3.0
4  5.0  5  5.0  NaN

In [12]:
#filling the missing data

In [13]:

df

     A  B    C    D
0  1.0  1  1.0  NaN
1  NaN  2  NaN  2.0
2  3.0  3  3.0  3.0
3  4.0  4  NaN  NaN
4  5.0  5  5.0  NaN

In [14]:
df.fillna(0)  #fill the non-null value

     A  B    C    D
0  1.0  1  1.0  0.0
1  0.0  2  0.0  2.0
2  3.0  3  3.0  3.0
3  4.0  4  0.0  0.0
4  5.0  5  5.0  0.0

In [15]:
values={'A':0,'B':100,'C':200,'D':400}   #it work column wise
df.fillna(value=values)

     A  B      C      D
0  1.0  1    1.0  400.0
1  0.0  2  200.0    2.0
2  3.0  3    3.0    3.0
3  4.0  4  200.0  400.0
4  5.0  5    5.0  400.0

In [16]:
df.fillna(df.mean())

      A  B    C    D
0  1.00  1  1.0  2.5
1  3.25  2  3.0  2.0
2  3.00  3  3.0  3.0
3  4.00  4  3.0  2.5
4  5.00  5  5.0  2.5